## How do I rename columns in a pandas DataFrame?

In [3]:
import pandas as pd

### Read data and show column names

In [4]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [5]:
#read #prepare #cols #pandas
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

### How to rename cols

In [6]:
#IMPORTANT: PANDAS
#rename #read #prepare #cols #pandas
ufo.rename({'City': 'CITY', 'State': 'STATE'}, axis='columns').head()

#old: rename cols by specifying columns
#ufo.rename(columns={'City': 'CITY', 'State': 'STATE'},inplace=True)

                   CITY Colors Reported Shape Reported STATE             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [7]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [8]:
#IMPORTANT: PANDAS
#rename #cols #read #prepare #pandas

#Create a list of col names (shape must be like the DataFrame-shape)
ufo_cols=['city','colors reported','shape reported','state','time']
ufo.columns = ufo_cols

In [9]:
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [10]:
#IMPORTANT: PANDAS
#rename #cols #read #prepare #pandas

ufo_cols=['city','colors reported','shape reported','state','time']
ufo = pd.read_csv('http://bit.ly/uforeports',names=ufo_cols,header=0)

In [11]:
ufo.head(2)

          city colors reported shape reported state             time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

### How to fill spaces with underscores in columns

In [12]:
ufo.columns

Index(['city', 'colors reported', 'shape reported', 'state', 'time'], dtype='object')

In [13]:
#IMPORTANT: PANDAS
#rename #str #read #prepare #cols #pandas
#Prepare col-names: How to fill all spaces with underscores
ufo.columns = ufo.columns.str.replace(' ','_')

In [14]:
ufo.columns

Index(['city', 'colors_reported', 'shape_reported', 'state', 'time'], dtype='object')

### How to apply lowercase to all columns?

In [15]:
#IMPORTANT: PANDAS
#rename #str #lower #cols #read #prepare #pandas
ufo.rename(str.lower, axis='columns').head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

### How to add a prefix or a suffix to the columns?

In [16]:
#IMPORTANT: PANDAS
#rename #prefix #cols #read #prepare #pandas
ufo.add_prefix('X_').head()

,X_city,X_colors_reported,X_shape_reported,X_state,X_time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00

In [17]:
#IMPORTANT: PANDAS
#rename #suffix #cols #read #prepare #pandas
ufo.add_suffix('_Y').head()

,city_Y,colors_reported_Y,shape_reported_Y,state_Y,time_Y
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00